Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ཀླུའི་རྒྱལ་པོ་དེ་དག །པུས་མོ་གཡས་དང་གཡོན་པ་བཙུགས་པ་བྱའོ།
en: Lying at his right and left knees respectively are the two nāga kings.

source: །ཀླུའི་གདེངས་ཀ་དང་བཅས་པ། ཐལ་མོ་འཆང་བས་སྐྱབས་སུ་འགྲོ་བར་བྱེད་པར་བྱའོ།
en: They should be depicted with their nāga hoods expanded and their hands folded in añjali, taking refuge with Vidyārāja. “

source: །དེ་ནས་རིག་སྔགས་དེས་རས་རིས་དེ་ལ་མངོན་དུ་ཕྱོགས་ཏེ་སྨྲ་བ་བཅད་ནས་དོན་ཡོད་པའི་མཆོད་པའི་ནོར་བུའི་སྙིང་པོའི་གཟུངས་སྟོང་རྩ་བརྒྱད་དུ་བཟླས་པར་བྱ་སྟེ།
en: The vidyā holder should then sit facing the painting and recite the heart dhāraṇī of precious amogha offerings one thousand and eight times without speaking.

source: ཡུངས་ཀར་ལ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་བསྣུན་པར་བྱའོ།
en: He should incant some mustard seeds one thousand and eight times and strike the nāga king Sāgara with them.

source: །སྟོང་རྩ་བརྒྱད་རྫོགས་པ་དང་། ཆར་གྱི་རྒྱུན་ཆེན་པོ་འབེབས་པར་བྱེད་དོ།
en: When the vidyā holder has struck him one thousand and eight times, torrents of rain will fall as if it had not rained for a thousand years.

source: །གལ་ཏེ་ལོ་སྟོང་དུ་ཆར་མི་འབབ་པར་འགྱུར་བ་ལས་འཕྲལ་ཉིད་དུ་ལྷས་ཆར་འབེབས་པར་བྱེད་པར་ཐེ་ཙོམ་མེད་དོ།
en: There is no doubt that His Majesty will send rain instantly.

source: །རླུང་དང་། སད་དང་། སེར་བའི་དུས་སུ། དེའི་རས་རིས་ཁང་པའི་སྟེང་དུ་བཞག་སྟེ།
en: When there is a cold spell, strong winds, or hailstorms, the vidyā holder should place the painting at the top of the house.

source: རླུང་དང་སད་དང་སེར་བ་ཐམས་ཅད་ཕྱིར་ཞིང་མི་འབྱུང་ངོ་། །ཕྱོགས་གང་དུ་རས་རིས་རྣམ་པར་ལྟ་བར་བྱེད་པ་དེའི་ཕྱོགས་ཀྱི་གནས་སུ། རླུང་དང་། སད་དང་། སེར་བ་མི་འབབ་སྟེ།
en: The cold, winds, and hail will not occur again, and there will not be cold, wind, or hail in the direction the painting faces.

source: རིའམ། དགོན་དུང་འཁྲིགས་པར་ཡང་མི་འབབ་བོ།
en: The weather will descend into the mountains or jungle instead. “

source: །ཡང་ན་རིག་སྔགས་འཆང་གིས་རས་རིས་དེ་བཟུང་ནས། ཀླུའི་གནས་ཀྱི་མཚོར་སོང་ནས། གནས་ཀྱི་མཚོ་དེར་གཞག་པར་བྱའོ།
en: Optionally, the vidyā holder can take the painting to a lake inhabited by nāgas and install it there.

source: །དོན་ཡོད་ཞགས་པའི་མཆོད་པའི་ནོར་བུའི་སྙིང་པོའི་གཟུངས་སྟོང་རྩ་བརྒྱད་དུ་ཆུ་ལ་བཟླས་ཏེ་གནས་པའི་མཚོ་རུ་འཕང་བར་བྱའོ། །འཕངས་པ་ཙམ་གྱི་མོད་ལ།
en: He should incant a sweetmeat by reciting the Amoghapāśa heart dhāraṇī of precious offerings one thousand and eight times and cast it into the lake.

source: གནས་དེར་གནས་པའི་ཀླུ་ཁྱེའུའི་གཟུགས་ཀྱིས་ལུས་ཕྱེད་གནས་དེ་ནས་འཐོན་ཏེ།
en: As soon as the sweetmeat is cast, the nāga dwelling there will appear in the form of a boy emerging from the water up to his waist.

source: རས་རིས་དེ་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །རིག་སྔགས་འཆང་བ་ལ་སྨྲས་པ།
en: He will bow to the painting and say, ‘Please command me, vidyā holder!

source: རིག་སྔགས་འཆང་གིས་བཀའ་བསྒོ་བ་ཅི་ཡིན་པ་བདག་གིས་བགྱིའོ་ཞེས་སོ།
en: What can I do for you?’

source: །རིག་སྔགས་འཆང་གིས་སྨྲ་བར་བྱ་སྟེ། ཀླུ་ཆེན་པོ་འཛམ་བུའི་གླིང་ཀུན་ཏུ་ལྟ་བར་གྱིས་ཤིག །
en: The vidyā holder should reply, ‘Have a good look, O great nāga, at the continent of Jambudvīpa!’

source: ཁྱེའུ་དེ་ཡང་ཕྱོགས་བཞི་ཀུན་ཏུ་རྣམ་པར་ལྟ་བར་བྱེད་དོ། །ཇི་ལྟ་ཇི་ལྟར་མཚན་མ་མཐོང་བ་དེ་ལྟ་དེ་ལྟར་རིག་སྔགས་འཆང་ལ་མཚན་མ་སྨྲ་བར་འགྱུར་ཏེ། ལེགས་པར་བྱས་པའམ། ཉེས་པར་བྱས་པ་དེ་ཐམས་ཅད་སྨྲ་བར་བྱེད་དོ།
en: The nāga boy will then look in all the four directions and report to the vidyā holder any signs that he sees, reporting all that he sees, both the good and the bad. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་བརྗོད་པར་བྱ་སྟེ།
en: The vidyā holder should then say, ‘Send rain, O great nāga!

source: ཀླུ་ཆེན་པོ་ཆར་ཕོབ་ལ་ཚིམ་པར་གྱིས་ཤིག་འཛམ་བུའི་གླིང་པའི་རྩྭ་དང་ནགས་ཀྱི་བདག་པོ་དང་། རི་དང་ཚང་ཚིང་དང་དགོན་པ་དང་། ཞིང་དང་ཀུན་དགའ་ར་བ་རྣམས་ཐམས་ཅད་དུ།
en: Nourish the grasses, the trees of the forest, and the mountain thickets, valley meadows, and groves across Jambudvīpa!

source: ཆར་གྱི་རྒྱུན་འབྱིན་པར་གྱིས་ཤིག །
en: Release torrents of rain!

source: ལྷའི་ཆུས་ཀུན་ནས་ཆར་ཕོབ་ཅིག །
en: May the rain fall over the entire continent!

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྷའི་ཆུའི་ཆར་གྱི་རྒྱུན་ཆེན་པོ་ཕོབ་ཅིག །
en: Send torrents of rain for all beings!’

source: ཀླུའི་ཁྱེའུ་ལ་སྨྲས་པ།
en: The nāga youth will reply, ‘Hey vidyā holder!

source: ཀྱེ་བཅུད་ལེན་མཆོག་ཏུ་གྱ་ནོམ་པའི་རིག་སྔགས་ཀྱི་གཞི་བྱིན་ཅིག་ཅེས།
en: Please give me the best elixir of longevity!’

source: རིག་སྔགས་འཆང་གིས་བརྗོད་པར་བྱའོ། །ཀླུའི་ཁྱེའུ་བདུད་རྩི་བཅུད་ཀྱིས་ལེན་གྱི་མཆོག་ཟུང་ཤིག་ཞེས་སོ།
en: The vidyā holder should say, ‘Receive, O nāga youth, the best elixir there is!’

source: །དེ་ནས་ཀླུའི་ཁྱེའུ་དེ། རིག་སྔགས་འཆང་ལ་མངོན་དུ་ཕྱོགས་ཏེ་ཐལ་མོ་སྦྱར་ནས་ཉེ་བར་འདུག་གོ།
en: The nāga youth will wait in anticipation, facing the vidyā holder with folded hands.

source: །རིག་སྔགས་འཆང་གིས་ཀླུ་ཆེན་པོ་ཉོན་ཅིག་ཅེས་བརྗོད་པར་བྱའོ།
en: The vidyā holder should say, ‘Listen, great nāga!’

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་བསྟན་པར་བྱ། འཕགས་པའི་བདེན་པ་བཞི་པོ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྟན་པར་བྱའོ།
en: and explain dependent origination, the four truths of the noble ones, the eighteen unique qualities of a buddha, and the eightfold path of the noble ones.

source: །དོན་ཡོད་ཞགས་པའི་མདོ་ཡང་བསྟན་པར་བྱའོ།
en: He should also present the sūtra of Amoghapāśa. “

source: །གང་གི་ཚེ་རིག་སྔགས་འཆང་དེ་ལྟ་བུའི་དེ་བཞིན་གཤེགས་པའི་ཆོས་སྟོན་བཞིན་པ་ན། ཀླུའི་ལུས་ལ་བདུག་པ་འཁྲིགས་པའི་སྤྲིན་ཆེན་པོ་ངེས་པར་འཐོན་ཏེ། ནམ་མཁའི་དཀྱིལ་དུ་གཡོགས་པར་བྱེད་ཅིང་གནས་སོ།
en: When the vidyā holder presents the Dharma teachings of the Tathāgata in this way, clouds of incense smoke will issue from the body of the nāga and spread across the canopy of the sky.

source: །ཆོས་སྟོན་པའི་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ། ཆར་གྱི་རྒྱུན་ཆེན་པོ་འབབ་པར་བྱེད་དེ།
en: The moment the Dharma teachings are over, torrents of rain will fall.

source: སའི་མཚོ་དེར་ཆར་པ་འབབ་པ་མ་ཡིན་ནོ། །རིག་སྔགས་འཆང་དང་། རས་རིས་ཀྱི་སྟེང་དུ།
en: The rain, however, will not fall on the lake inhabited by the nāga, the painting, or the vidyā holder.

source: ཀླུའི་ཁྱེའུ་དེ་རས་རིས་དེ་ལ་མཆོད་པ་བྱེད་དེ། རིག་སྔགས་འཆང་དེ་ལ་ཡོན་དང་བཅས་པས་ཆོས་ལ་མཆོད་པ་འབུལ་བར་བྱེད་དེ།
en: The nāga youth will worship the painting with offerings and will also offer due worship to the vidyā holder, piling up offerings for him.

source: རིག་སྔགས་འཆང་གིས་སྨྲས་པ། རིག་སྔགས་འཆང་གི་སར་ཁྱོད་ཞུགས་ཤིག །
en: He will say to the vidyā holder, ‘Please enter my dwelling, O vidyā holder.

source: དེ་རྣམས་འདི་སྐད་ཅེས་རིག་སྔགས་འཆང་རང་གི་ཁྱིམ་གྱིས་མཆོག་གོ།
en: This fine house of mine is now yours.’

source: །རིག་སྔགས་འཆང་གིས་སྨྲ་བར་བྱ་སྟེ། གལ་ཏེ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འཁོར་དང་བཅས་པ། ཡང་དག་པར་ལེན་པར་བྱེད་ན། དེའི་ཚེ་ང་ཁྱོད་ཀྱི་གནས་མཆོག་ཏུ་འཇུག་པར་བྱའོ།
en: The vidyā holder should reply, ‘I will enter your house if you and your retinue take up the path and practice the ten virtues.

source: གལ་ཏེ་མི་བྱེད་ན་འཇུག་པར་མི་བྱའོ་ཞེས་སོ།
en: If you do not practice them, I will not enter.’

source: །དེ་ནས་ཁྱེའུ་དེ། གལ་ཏེ་བྱེད་ན། དགེ་བ་སྟོན་པ་མཐོང་བ་དེའི་ཚེ་རང་གི་གཟུགས་ཀྱིས་གནས་པར་བྱེད་དེ། ལྷ་རྫས་ཀྱི་རྣ་རྒྱན་དྲི་མ་མེད་པ་གཡོ་བ་སྐྲའི་ཅོད་པན་འཆང་བ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པའོ།
en: If the nāga youth decides to practice the ten virtues, he will remain in his own divine form with a diadem upon his curly hair and be adorned with all ornaments.

source: །གལ་ཏེ་མི་བྱེད་ན་ཁྱེའུ་དེའི་གཟུགས་མི་སྣང་བར་འགྱུར་ཏེ། སླར་ཡང་མི་མཐོང་ངོ་།
en: If he decides not to practice them, he will disappear and will never be seen again in this youthful form. “

source: །ཡང་ན་རྫུ་འཕྲུལ་ཆེན་པོ་ཅན་གྱི་ཀླུའི་རྒྱལ་པོ་མཐོང་བར་འདོད་པའི་རིག་སྔགས་འཆང་དེས། ཟངས་ཀྱི་འདབ་མ་ལ་དོན་ཡོད་པའི་མཆོད་པའི་ནོར་བུའི་སྙིང་པོའི་གཟུངས་དེའི་སྟེང་དུ་བྲི་བར་བྱ་སྟེ་སྦྲང་རྩིས་བྱུག་པར་བྱའོ། །ཡུངས་ཀར་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་དུ་ཡོངས་སུ་བཟླས་ཏེ་གཏོར་བར་བྱ་སྟེ། གནས་པའི་མཚོ་དེར་འཕང་བར་བྱའོ། །གུ་གུལ་ཞོ་གཅིག་ཚད་ཀྱིས་མཆོད་ནས་བདུག་པ་སྦྱིན་པར་བྱའོ།
en: If the vidyā holder wants to meet a nāga king with great magical powers, he should write the heart dhāraṇī of precious amogha offerings upon a copper plate, smear the plate with honey, sprinkle it with mustard seeds incanted one hundred and eight times, and throw it into a lake inhabited by nāgas.

source: །ཇི་སྲིད་དུ་གུ་གུལ་ཕྱེད་ཀྱི་ཆ་ཤས་ཀྱི་ལྷག་མ་ལས་ཀྱི་བར་དུ་བསྲེག་པར་བྱའོ།
en: He should light incense made with one karṣa of bdellium and wait until only half of it remains.

source: །སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་དེ་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་བྲམ་ཟེའི་གཟུགས་ཀྱིས་ཀླུའི་མཚོར་ཉེ་བར་འདུག་སྟེ། རིག་སྔགས་འཆང་ལ་ཤིས་པ་རྗོད་པར་བྱེད་དོ། །རིག་སྔགས་འཆང་གིས་ཀྱང་།
en: At that moment Sāgara, the great nāga king, will emerge from the nāga lake in the form of a brahmin and will greet the vidyā holder. “

source: ནད་མེད་པར་གྱུར་ཅིག་ཅེས་བརྗོད་པར་བྱའོ།
en: The vidyā holder should say, ‘Hey, are you in good health?

source: །ཀྱེ་ཆོས་ཀྱི་དོན་གྱི་ཚིག་ཉོན་ཅིག །
en: Listen to the meaningful words of the Dharma!

source: ཆོས་དང་འཇིག་རྟེན་མང་པོ་ཡང་སྐྱོངས་ཤིག་ཅེས་སོ།
en: Protect the many teachings and the world!’

source: །བྲམ་ཟེ་དེ་ཡང་དགའ་སྟེ།
en: The brahmin will be pleased and say, ‘Why, O vidyā holder, would one want meaning?

source: རིག་སྔགས་འཆང་ཅི་འདོད་པའི་དོན་གང་ཡིན་པའི་དོན་དེ་སྨྲོས་ཤིག་དང་།
en: Tell me what is it that constitutes meaning.’

source: ཐམས་ཅད་སྨྲ་བར་འགྱུར་རོ།
en: The vidyā holder should explain everything.

source: །ཞེས་རྗོད་པར་བྱེད་དོ། །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཆེན་པོ་བདུན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་བདུན་དང་། ཉན་ཐོས་ཆེན་པོ་བཞིའི་མཚན་ནས་སྨོས་པར་བྱའོ། །དེ་ནས་བྲམ་ཟེ་དེ་རྣམ་པ་དེ་ལྟ་བུའི་ཚིག་གི་སྒྲ་ཐོས་ནས།
en: The brahmin will thus learn the names of the seven great tathāgatas, the eight great bodhisattvas, and the four great śrāvakas.

source: ཡིད་རབ་ཏུ་དགའ་སྟེ། སྙིང་མགུ་བ་ཆེན་པོར་གྱུར་ནས་རིག་སྔགས་འཆང་ལ་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་རྗོད་པར་བྱེད་དེ།
en: Having heard the teachings and being eager at heart, he will applaud the vidyā holder with the words ‘Good!

source: ལེགས་སོ་ལེགས་སོ་ཞེས་སྒྲ་འབྱིན་པར་བྱེད་དོ།
en: It is good!

source: །མཚན་ཤིན་ཏུ་བསྔགས་པ་གང་ཡིན་པ་དེ། ཁྱོད་ཀྱིས་ཡོངས་སུ་འཛིན་པ་དང་།
en: These auspicious names you know are indeed most illustrious and worth hearing.

source: ལེགས་པར་ཡོངས་སུ་གྲགས་པའི་མཚན་ཤིན་ཏུ་མཉན་པར་འོས་པ་མཆོག་ཏུ་རྙེད་པར་དཀའ་བ་སྟེ།
en: You have proclaimed names that are extremely difficult to come by.

source: མཚན་ཁྱོད་ཀྱི་ཡོངས་སུ་བསྒྲགས་པ་མཆོག་ཏུ་རྙེད་པར་དཀའ་བ་ཉིད་རིག་སྔགས་འཆང་གང་གིས། འདི་ལྟ་སྟེ། སེམས་ཅན་དེ་རིན་པོ་ཆེ། དོན་ཡོད་པ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པའི་མཚན་འཛིན་པར་བྱེད་པ་སེམས་ཅན་རྣམས་ཀྱི་མཆོག་ཐོས་པར་བྱེད་དོ་ཞེས་སོ།
en: It is very rare, O vidyā holder, to meet you, you who uphold the names of such praiseworthy beings, such precious amogha creations, and tell others about these supreme beings.’ “

source: །དེ་ནས་བྲམ་ཟེ་དེ་བྲམ་ཟེའི་གཟུགས་ཀྱི་ཆ་བྱད་དེ་མི་སྣང་བར་བྱས་ནས། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་གཟུགས་ཀྱི་ཆ་བྱད་དང་། རྟགས་ཀྱིས་ཇི་ལྟ་བ་བཞིན་དུ། རིག་སྔགས་འཆང་གི་མདུན་དུ་འདུག་སྟེ་སྨྲ་བར་ཡང་བྱེད་དོ།
en: While saying these words, the brahmin will cast off his apparel and the form of a brahmin and stand before the vidyā holder, in his own form and apparel, as the nāga king Sāgara, complete with all his characteristics and mannerisms.

source: །རིག་སྔགས་འཆང་མཆོག་ཇི་ལྟར་མངོན་པར་འདོད་པ་སྨྲོས་ཤིག་དེ་ཐམས་ཅད་རྗེས་སུ་སྩལ་བར་བགྱིའོ།
en: He will say, ‘Please ask for a boon, vidyā holder. I will grant anything you ask for.’

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཇི་ལྟར་མངོན་པར་འདོད་པའི་མཆོག་ཐམས་ཅད་བརྗོད་པ་དེ་སྟེར་བར་འགྱུར་རོ། །ཡང་ན་མཆོག་ཏུ་འཇུག་པར་བྱེད་དོ།
en: The vidyā holder should state what boons he desires, and Sāgara will either grant all of them himself or employ Uttara.

source: །ཀླུའི་རྒྱལ་པོ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་ཉེ་བར་གནས་སོ།
en: All the nāga kings with their retinues will fall under the vidyā holder’s thrall and attend upon him.

source: །ལས་ཐམས་ཅད་བཀའ་བསྒོ་བ་ཙམ་གྱིས་བྱེད་པར་འགྱུར་ཏེ།
en: They will carry out all activities as soon as they are ordered to do so.

source: འདི་ལ་དོགས་པ་དང་། ཡིད་གཉིས་བསྐྱེད་པར་མི་བྱའོ། །སྦྱར་བ་ཙམ་གྱི་མོད་ལ།
en: One should not harbor doubts about this or hold thoughts to the contrary.

source: བྱ་བ་འདི་རྣམས་ཐམས་ཅད་འགྲུབ་པར་འགྱུར། དེ་ནས་རས་རིས་བླངས་ཏེ། རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་བཏགས་པར་བྱས་ནས། ཞིང་དང་ཀུན་དགའ་ར་བ་ཐམས་ཅད་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བར་བྱ་སྟེ། རླུང་དང་། ཚད་པ་དང་། སད་དང་། སེར་བ་དང་། སྦྲང་བུ་དང་། སྦྲང་བུ་མཆུ་རིངས་དང་། ཆ་ག་པ་དང་། བྱི་བ་དང་། ནེ་ལེ་དང་། ཁྱི་དང་། ཅེ་སྤྱང་དང་། གྲོག་སྦུར་དང་། སྤྲུལ་གོ་ཎ་ས་དང་།
en: Every task will be accomplished as soon as the nāgas apply themselves to it. “

source: སྡིག་པ་དང་། སྦྲང་བུ་ཏྲེ་མ་བུ་ག་དང་། སྦྲང་བུ་ཏྲི་ལ་ཊ་དང་། སྦྲུལ་གདུག་པ་དང་། དུག་གི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་ཏེ།
en: If the vidyā holder mounts the painting upon a banner and walks clockwise around any garden or field, it will be free from any danger of cold spells, strong winds, heat waves, hail, gadflies, mosquitos, locusts, rats, mongooses, dogs, jackals, creeping animals, gonāsa snakes, scorpions, tṛmbuka, horse flies, snakes, and āśīviṣa snakes.

source: འཕྲལ་ཉིད་དུ་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: All of them will leave immediately.

source: །ལོ་ཐོག་དང་། མེ་ཏོག་དང་། འབྲས་བུ་རྣམས་ལེགས་པར་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །རོ་བཟང་བ་དང་། ལེགས་པར་སྨིན་པར་འགྱུར་རོ།
en: All crops, flowers, and fruits will grow well, ripen fully, and taste delicious. “

source: །དོན་ཡོད་པའི་ནོར་བུ་མཆོད་པའི་སྙིང་པོའི་ཀླུའི་ཆར་འབེབས་པའི་ཆོ་གའོ།
en: This concludes the practice procedure of causing the nāgas to send rain by the means of the heart dhāraṇī of precious amogha offerings. “

source: །དེ་ནས་འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། འབྲོག་དགོན་པའི་འཇིགས་པ་རབ་ཏུ་ཞི་བར་འདོད་པའི་རིག་སྔགས་འཆང་དེས་རིག་པའི་རྒྱལ་པོ་འབའ་ཞིག་རས་ལ་བྲི་བར་བྱ་སྟེ།
en: If the vidyā holder wants to pacify all quarrels, disputes, disagreements, invasions by foreign armies, or dangers encountered in the wilderness, all he needs to do is draw the king of vidyās on the edge of his garment.

source: དཔལ་ལྷ་མོའི་གཟུགས་དང་། ཁ་དོག་དང་། རྟགས་དང་། དབྱིབས་དང་། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ།
en: He should have the form, color, and characteristics of the goddess Śrī, be adorned with all ornaments, and be crowned with Amitābha as his crest jewel.

source: འོད་དཔག་མེད་ཀྱི་ཅོད་པན་འཆང་བའི་རྒྱལ་པོ་ཆེན་པོ་བཞི་བྲི་བར་བྱའོ། །ཚོན་སྣ་ཚོགས་པ་རྣམ་པར་བཀྲ་བའི་རྒྱལ་མཚན་གྱི་མཆོག་གདགས་པར་བྱའོ།
en: The vidyā holder should also draw the Four Great Kings and paint them in various bright colors.

source: །ཀླུའི་རྒྱལ་པོའི་ཕོ་བྲང་དུ་འཇུག་པར་བྱའོ། །དོན་ཡོད་པའི་ཞགས་པའི་ནོར་བུའི་སྙིང་པོའི་གཟུངས་འདི་ཡང་བརྗོད་པར་བྱ་ཞིང་འཇུག་པར་བྱ་སྟེ།
en: He should mount the painting upon a banner and enter the capital city while mindfully reciting the same heart dhāraṇī of Amoghapāśa of precious offerings. “

source: དང་པོར་རྒྱལ་མཚན་གྱི་མཆོག་མཐོང་བ་ཙམ་གྱི་མོད་ལ་བུད་མེད་དང་སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་ཐམས་ཅད་ཀྱི་ནད་ཐམས་ཅད་དང་། འཇིགས་པ་ཐམས་ཅད་དང་།
en: As soon as they see the banner, the women, men, boys, and girls in the city will be cured of all disease and freed from every danger.

source: སྒྲིབ་པ་ཐམས་ཅད་དང་། སྡིག་པ་ཐམས་ཅད་དང་། ནད་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་ལོ། །ཉེས་པར་བྱས་པ་དང་།
en: All their obscurations, evil, and ailments will be completely eradicated.

source: སྡིག་པ་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་ལོ། །དུག་དང་བྱད་སྟེམས་དང་། ཕྱེ་མའི་སྦྱོར་བའི་དུག་དང་། དུག་གི་འཇིགས་པ་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་ལོ། །དགྲའི་འཇིགས་པ་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་ལོ།
en: They will be free from the effects of all their evil deeds, and the dangers caused by garas, kākhordas, poisons, venoms, poisonous powder preparations, and enemies will vanish.

source: །སྡིག་པ་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་ལོ།
en: The people will be free from all their impurities.

source: །རྒྱལ་མཚན་གྱི་མཆོག་ལ་བཏགས་པ་མཐོང་ནས་མཐོང་བ་ཙམ་གྱི་མོད་ཁོ་ན་ལ། སྔོན་གྱི་སྡིག་པ་དང་། སྒྲིབ་པ་དང་། མཚམས་མེད་པ་ལྔའི་འགྲོ་བ་རྣམས་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་ཏེ།
en: When they see the deity mounted upon the banner, they will be free from their previously accumulated obscurations and wrongdoings, including the five acts of immediate retribution and the ensuing destinies.

source: འདི་ལ་ཐེ་ཚོམ་དང་། ཡིད་གཉིས་བསྐྱེད་པར་མི་བྱའོ། །དང་པོར་གྲོང་ཁྱེར་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་དུ་རྒྱལ་མཚན་གྱི་མཆོག་འདི་ཞུགས་པ་ཙམ་གྱི་མོད་ལ་མི་ངས་དང་།
en: One should not harbor any doubts about this, or thoughts to the contrary. “

source: མུ་གེ་དང་། ཡམས་ཀྱི་ནད་དང་། འབྲོག་དགོན་པའི་ཉེ་བར་འཚེ་བ་དང་། འགོ་བའི་ནད་དང་། འཁྲུག་པ་ཐམས་ཅད་དང་། གདོན་དང་།
en: The moment the banner is brought into the capital city, all pestilence, famine, calamity, disaster, catastrophe, accidents, and troubles will be pacified.

source: འབྱུང་པོ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲིབ་གནོན་དང་། བརྗེད་བྱེད་ཐམས་ཅད་དང་། ལོག་པར་འདྲེན་པའི་འཇིགས་པ་མི་བཟད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །འཐབ་པ་དང་། འཐབ་མོ་དང་། རྩོད་པ་དང་། འགྱེད་པའི་འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། ཕྱིར་རྒོལ་བ་དང་། དགྲའི་འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །ཆོམ་རྐུན་དང་། གཡོན་ཅན་དང་།
en: All grahas, bhūtas, yakṣas, rākṣasas, pretas, piśācas, chāyās, apasmāras, vighnas, vināyakas, and other terrifying beings will also be completely pacified, as will the danger of quarrels, disputes, disagreements, killings, armies, opponents, adversaries, thieves, rogues, and bandits.

source: རྐུན་མོའི་འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །རྨི་ལམ་ངན་པ་དང་། མཚན་མ་ངན་པ། བཀྲ་མི་ཤིས་པའི་དངོས་པོ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་དོ། །ཡུལ་དང་། གྲོང་དང་།
en: All bad dreams, bad omens, and inauspicious phenomena will disappear.

source: དགོན་པ་པ་དང་། ནགས་ཚང་ཚིང་དང་། གྲོང་ཁྱེར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་རྣམས་ཐམས་ཅད་དུ་ཡང་། བདེ་བ་བྱེད་པར་འགྱུར་རོ། །ལོ་ལེགས་པ་དང་། དགའ་བར་འོས་པ་དང་།
en: Safety will be restored in all villages, towns, forest settlements, cities, and the capital city of the realm, and all the beings that live there will enjoy prosperity and happiness without misfortune or health problems.

source: སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚེ་བ་མེད་པ་དང་། ནད་མེད་པར་འགྱུར་རོ། །སེམས་ཅན་དེ་རྣམས་ཐམས་ཅད་དུ་ཡང་། ཕན་ཚུན་དུ་དགའ་བ་དང་། རབ་ཏུ་མགུ་བ་ཆེན་པོས་ཕན་ཚུན་བྱམས་པའི་སེམས་སུ་འགྱུར་རོ།
en: They will all feel strong mutual affection and will delight in their interactions with their hearts filled with love. “

source: །དོན་ཡོད་པའི་མཆོད་པའི་ནོར་བུའི་སྙིང་པོའི་གཟུངས་འདི་ཡིད་རྩེ་གཅིག་པས་ཚེས་བཅོ་ལྔའི་ཉ་ལ་ཉིན་མཚན་ཐོག་ཐག་ཏུ་སྨྱུང་བར་གནས་པས་གཙང་མ་གོས་གཙང་མ་བགོ་བར་བྱའོ།
en: The vidyā holder, after fasting for one day and one night, should focus his mind one-pointedly on the heart dhāraṇī of precious amogha offerings and commence the following rite on the night of fifteenth lunar day, the day of the full moon.

source: །འབྱུང་ལྔའི་ཉེ་རེག་གིས་གཙང་སྦྲ་དང་། ཁྲུས་དང་། དྲིའི་ཆུ་ཙམ་གྱིས་རྗེས་སུ་མཐུན་པའི་བྱུག་པ་བྱས་ཏེ།
en: He should maintain ritual purity, bathe thoroughly, wear clean clothes, and sprinkle himself with the five products of the cow and perfumed scented water.

source: སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་ནས་རིག་པའི་རྒྱལ་པོ་ལ་མངོན་དུ་ཕྱོགས་ནས་བཟླས་བརྗོད་བྱའོ། །མཚན་ཐོག་ཐག་ཏུ་མཆོད་པ་ཆེན་པོ་རྒྱུན་མི་འཆད་པར་བསྒྲུབ་པར་བྱའོ།
en: He should then sit in a cross-legged posture in front of the painting of the king of vidyās and recite the dhāraṇī through the night without interruption.

source: །དྲིའི་ཏིལ་མར་གྱི་མེ་དབུལ་བར་བྱ་ཞིང་།
en: He should make many offerings, burn lamps of scented oil, and recite the dhāraṇī.

source: བགྲང་ཕྲེང་དཔག་ཏུ་མེད་པ་བྱས་པའི་བཟླས་བརྗོད་དབུལ་བར་བྱའོ། །ལན་རེ་རེ་བཟླས་པས་ལན་བརྒྱ་སྟོང་ཕྲག་ཡོངས་སུ་བཟླས་པར་འགྱུར་རོ།
en: The recitations will multiply infinitely, with each individual repetition being multiplied one hundred thousand times.

source: །ཇི་སྲིད་དུ་རིག་པའི་རྒྱལ་པོའི་བྲིས་སྐུ་འབར་བར་བྱེད་དོ། །འདི་ལྟ་སྟེ། འོད་ཟེར་སྣ་ཚོགས་པ་འབྱིན་པར་བྱེད་དོ།
en: He should keep reciting until the king of vidyās in the painting radiates light in various colors. “

source: །རིག་སྔགས་འཆང་དགའ་བར་བྱེད་ཅིང་། སྤྱི་བོའི་གཙུག་ནས་འབར་བར་བྱེད་དོ།
en: The vidyā holder will be thrilled, his head will beam with light, and he will hear a voice coming from the sky that says, ‘Good!

source: །ནམ་མཁའ་ནས་རིག་སྔགས་འཆང་ཁྱོད་ཀྱིས་བཟླས་བརྗོད་ཀྱི་ཆོ་ག་མཆོག་ཏུ་བྱས་པ་ལེགས་སོ་ལེགས་སོ་ཞེས་སྒྲ་འབྱིན་པར་བྱེད་དོ།
en: It is good, vidyā holder! You have performed the supreme recitation procedure.

source: །འདི་ནི་རིག་སྔགས་འཆང་རྣམས་ཀྱི་མཆོག་གི་བཟླས་པའི་ཆོ་ག་སྟེ། ཁྱོད་ཀྱིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་བྱས་པར་གྲུབ་བོ།
en: You have accomplished this supreme procedure of the vidyā holders, the maṇḍala of liberation that is the heart essence of Amoghapāśa revered by all the bodhisattvas.

source: །ཁྱོད་ཀྱིས་དོན་ཡོད་པའི་མཆོད་པའི་ནོར་བུའི་སྙིང་པོའི་གཟུངས་ཀྱི་དངོས་གྲུབ་ཀྱང་གྲུབ་བོ།
en: You have accomplished the heart dhāraṇī of precious amogha offerings.

source: །ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་དང་། ཐུན་མོང་གི་སྙིང་པོ་དང་གཟུངས་སྨྲས་པས། རིག་པ་འཛིན་པའི་མཆོག་དེ་ཐམས་ཅད་རྗེས་སུ་མཐུན་པར་སྩོལ་བར་འགྱུར་རོ། །འདི་ལྟ་སྟེ་གསང་སྔགས་ཀྱི་དངོས་གྲུབ་བམ། གཟུངས་ཀྱི་དངོས་གྲུབ་བམ། ཆོ་ག་ཞིབ་མོའི་དངོས་གྲུབ་བམ། རིགས་ཐུན་མོང་བའི་དཀྱིལ་འཁོར་གྱི་དེ་བཞིན་གཤེགས་པའི་དངོས་གྲུབ་བམ། ཕྱག་རྒྱའི་དམ་ཚིག་གི་དངོས་གྲུབ་བམ། ནམ་མཁའ་ལ་འགྲོ་བའམ། མི་སྣང་བའམ།
en: You have accomplished the heart dhāraṇī for all secret maṇḍalas and mudrās of all tathāgatas.

source: གཟུགས་སྣ་ཚོགས་སུ་བསྒྱུར་བའམ། མིག་འཕྲུལ་ལམ། རྫུ་འཕྲུལ་སྟོན་པའམ། ཀླུའི་གཞལ་མེད་ཁང་ངམ། ལྷའི་གཞལ་མེད་ཁང་ངམ། གནོད་སྦྱིན་གྱི་གཞལ་མེད་ཁང་ངམ།
en: Choose, vidyā holder, a boon, and I will grant it in full, whether it is the accomplishment of a mantra, the obtainment of a dhāraṇī, the accomplishment of a rite or of a maṇḍala shared by all tathāgata families, the secret accomplishment of a samaya mudrā, the ability to walk on air, the ability to become invisible, the ability to assume various physical forms, the ability to create magical illusions, the ability to display magical powers, or the ability to conjure the palaces of nāgas, devas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, or mahoragas, the palaces of the sun, moon, stars, or nakṣatras, the palaces of rākṣasas, or any kind of palaces designed according to your wish.

source: དྲི་ཟའི་གཞལ་མེད་ཁང་ངམ། ལྷ་མ་ཡིན་གྱི་གཞལ་མེད་ཁང་ངམ། ནམ་མཁའ་ལྡིང་གི་གཞལ་མེད་ཁང་ངམ། མིའམ་ཅིའི་གཞལ་མེད་ཁང་ངམ་ལྟོ་འཕྱེ་ཆེན་པོའི་གཞལ་མེད་ཁང་ངམ། ཉི་མའི་གཞལ་མེད་ཁང་ངམ། ཟླ་བའི་གཞལ་མེད་ཁང་ངམ། སྐར་མའི་ཚོགས་ཀྱི་གཞལ་མེད་ཁང་ངམ། རྒྱུ་སྐར་གྱི་གཞལ་མེད་ཁང་ངམ། སྲིན་པོའི་གཞལ་མེད་ཁང་ངམ། འདོད་པའི་གཟུགས་ཀྱི་གཞལ་མེད་ཁང་ཡང་རུང་སྟེ་དེ་ཐམས་ཅད་རྗེས་སུ་འཛིན་ནོ།
en: Please accept any of these.

source: །འདི་ནི་ཁྱོད་ཀྱིས་བྱ་བ་ཐམས་ཅད་བཀླགས་པས་འགྲུབ་ཅིང་བཟླས་པ་ཙམ་གྱིས་འགྲུབ་པར་འགྱུར་རོ། །ཀྱེ་རིག་སྔགས་འཆང་བྱ་བ་རྣམ་པ་སྣ་ཚོགས་པ་དེ་རྣམས་རྗེས་སུ་འཛིན་ནོ། །འདི་ལྟ་སྟེ། ནོར་སྒྱུར་བར་སྨྲ་བ་དང་།
en: You can accomplish any task by merely reading or reciting the dhāraṇī; it will be accomplished upon recitation.

source: ཞིང་སྨྲ་བ་དང་།
en: Hey vidyā holder!

source: ནོར་བུ་སྨྲ་བ་དང་། ཞགས་པའི་དངོས་གྲུབ་དང་། མིག་སྨན་སྒྲུབ་པ་དང་། ཐིག་ལེ་སྒྲུབ་པ་དང་། དབང་ཕྱུག་དང་། བློན་པོ་དང་། བཀྲབས་པ་དང་། མདུན་ན་འདོན་ཉིད་དང་། སྟོབས་ཆེ་བ་ཉིད་དང་། ལོངས་སྤྱོད་ལ་དམིགས་པ་དང་།
en: Accept various gifts such as the knowledge of alchemy, geology, and gems, or the siddhi of the noose, the siddhi of the eye ointment, or the siddhi of the bindi.

source: ཡུལ་གྱི་བདག་པོ་ཉིད་དང་། དབང་ཕྱུག་དང་། ནོར་འཕེལ་བ་དང་། གཏེར་གཡོ་བ་དང་། ཉོ་ཚོང་གི་གྲོགས་བྱེད་པ་དང་། འགུགས་པ་དང་། ཁུང་དུ་འཇུག་པ་དང་། རི་ལ་འཇུག་པ་དང་། ནགས་སུ་འཇུག་པ་དང་། མེ་ལ་འཇུག་པ་དང་། ས་འོག་ཏུ་འཇུག་པ་དང་། ཀླུའི་ཆར་འབེབས་པ་དང་། ཆར་གྱི་རྒྱུན་དང་། སེར་བའི་རྒྱུན་དང་། སེར་བ་འབེབས་པ་དང་། གྲོང་ལྟ་བ་དང་། གཡུལ་དུ་འཇུག་པ་དང་། རིག་སྔགས་འཆང་ཉིད་དང་། སངས་རྒྱས་ཀྱི་ཞིང་མཐོང་བ་ཉིད་དང་།
en: Please accept the position of a powerful king, minister, or senior priest, the obtainment of great power and many enjoyments, the position of a ruler of the realm, the obtainment of influence, an increase in wealth, the ability to transfer treasures, the ability to buy and sell profitably, the ability to summon and bring beings together, the ability to enter hidden passages, mountains, groves, fire, or subterranean paradises, the ability to compel nāgas to send rain, the ability to stop the rain, the ability to stop and start hail, the ability to conjure a posse of men, and the ability to instigate a battle, become a vidyādhara, and see buddha fields.
